<a href="https://colab.research.google.com/github/JAEILJEON/JAEIL_DATA/blob/main/210628_Pandas_%EB%B3%B5%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### 구글드라이브 연동

In [1]:
# 구글드라이브 연동
from google.colab import drive
drive.mount('/gdrive', force_remount=True)

# 구글 드라이브 파일 확인
!ls '/gdrive/My Drive/temp/'

# 반복되는 드라이브 경로 변수화
drive_path = '/gdrive/My Drive/temp/'

Mounted at /gdrive
 매수종목1.txt		   little-char.png	   seoul_map.html
 매수종목2.txt		   ml_class.png		   sonar.csv
 adult.data		   pca_1.png		   stock-data.csv
 auto-mpg.csv		   pca_2.png		  'stock price.xlsx'
 bmi_500.csv		   pca_3.png		  'stock valuation.xlsx'
 citibike.csv		   Picture1.png		   test.db.db
 매수종목.csv		   population_number.csv   test.txt
 data_mine.csv		   ram_price.csv	   ThoraricSurgery.csv
 data_population.csv	   ratings_small.txt	   titanic.xls
 data_studentlist_en.csv   ratings_test.txt	   tmdb_5000_credits.csv
 demo.docx		   ratings_train.txt	   tmdb_5000_movies.csv
 diabetes.csv		   sample1.pdf		   Traffic_Accident_2017.csv
 example.docx		   sample2.pdf		   train.csv
 height_weight.txt	   sample.docx		   user_id_mean.csv
 HelloWorld.xlsx	   sample_merge.pdf	   wine.csv
 house_price.csv	   sample.xlsx		   주가데이터.xlsx
 lenna.png		   score.csv		   남북한발전전력량.xlsx

# Pandas
데이터 핸들링

## Pandas 기초
Pandas 모듈
- Series Class : 1차원
 - 인덱스(index) + 값(value)
- DataFrame Class : 2차원
 - 표와 같은 형태

In [2]:
#판다스는 표중심 데이터. 3차원 없음. 
#둘 다 클래스다.

import pandas as pd   #np는 넘파이였는데 판다스는 pd네!

### Series

In [ ]:
#넘파이에서는 ndarray가 자료구조였는데, 판다스는 자료구조가 2개임. series와 data frame
#판다스는 Series (ndarray와 거의 동일) 1차원으로 이뤄진 것. 한 열을 시리즈라고 함.
#데이터 프레임은 이런 시리즈가 잔뜩 모여있는 거임. 시리즈(열)들이 모여있는 것.
#문서데이터를 보통 테이블 데이터라고 표현함.

s = pd.Series( [4,7,-5,3], index=[ 'a','b','d','f'] )   #넘파이 ndarray하는 방식과 일치함.
s

#오 판다스는 인덱스와 값으로 이루어져있네. 앞부분이 인덱스, 뒷부분이 값.
#키 값으로 이뤄진 것과 같다. dtype()도 자동으로 나오네!
#앞에는 값 부분, 인덱스 = [] 부분은 인덱스 이름 지정!

a    4
b    7
d   -5
f    3
dtype: int64

In [ ]:
#값만 확인하기
print(s.values)
#인덱스만 가져오기
print(s.index)    # 인덱스가 문자로 바뀌었기 때문에 object 타입으로 바뀐 것!
#타입 확인해보기!
print(s.dtype)

[ 4  7 -5  3]
Index(['a', 'b', 'd', 'f'], dtype='object')
int64

#### Pandas 연습 01
각 도시의 2015년 인구 데이터를 시리즈로 만드시오.
```
서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
```

In [ ]:
#흠 한번 만들어볼까?
#인덱스는 서울, 부산, 인천, 대구네. 값은 뭐 또 쭉 있고.

s = pd.Series( [9904312,3448737,2890451,2466052], 
              index=['서울','부산','인천','대구'] ) #두 줄로 만들어도 한 줄로 인식함!
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

#### Series

In [ ]:
#시리즈에는 이름도 넣을 수 있다. 그러니까 컬럼명. 열 이름을 넣어줄 수 있다. 헤더처럼?
# .name =

s.name = '인구'
s.index.name = '도시'   #인덱스에도 이름 붙여주기 가능~
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [ ]:
#시리즈의 연산

s / 1000000 #지금 원본은 그대로임. ndarray랑 연산 방법이 같지? 판다스 연산은 넘파이 연산하고 똑같아. 
            #행렬 연산이라 그런듯? 스칼라배 해주면 당연히 같지~

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [ ]:
#중요한 거! 인덱스! 인덱스에 접근하기!

#서울에 접근하기
s[0], s['서울']   #동일하게 접근하는 것. 어 그럼 슬라이싱도 이렇게?

(9904312, 9904312)

In [ ]:
#슬라이싱. 
#부산과 인천을 가져오고 싶다!
s[1:3]

#부산에서부터 대구까지 가져오고 싶다면?
s[1:4]

#시리즈는 좀 다르게 인덱스를 범위로 쓸 수도 있다.
#부산부터 대구까지 인덱스로 가져온다면?
s['부산':'대구'] #이렇게 슬라이싱 할 때는 이상 미만이 아님. 왜냐면 0부터 가져오는 개념이 아니기 때문에!! 인덱스를 str로 가져오면 그냥 가져오는 거임! 더 직관적이니까 좋긴 해!

부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [ ]:
#팬시 인덱싱

#서울 대구 부산만 가져오고 싶다면?
s[ [0,3,1] ] #순서대로 되어있지 않아도, 리스트 내에 저장되어있는 순서대로 그대로 가져옴

s[ ['서울', '대구', '부산'] ] #내가 바꾼대로 되네~

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [ ]:
#boolean 인덱싱. 조건식 넣는 거!
#인구 250만명 이상인 도시만 찾아보기
s[ s[:]> 2500000 ]
s[ s >= 2500000 ] 

#둘 다 같은 값이 나오네?

서울    9904312
부산    3448737
인천    2890451
dtype: int64

In [ ]:
#인구 500만 이하 도시
s[ s <= 5000000 ]

#인구 250만 이상, 500만 이하 도시
#이건 내가 푼 거. 다른 방법 뭐 없나?
v = s[ s <= 5000000 ]
x = v[ v >= 2500000 ]
x

#and 연산자는 그냥 쓰면 사용불가임. 왜냐면 연산자 우선순위가 존재하는데, 지금 누가 먼저 진행되야하는지 모름.
#여기서는 괄호로 우선순위를 지정해줬기 때문에 사용 가능.
s [ (s[ s <= 5000000 ]) & (s[ s >= 2500000 ]) ]

#앞에와 똑같은 효과를 냄. 그냥 이렇게 나열해도 가능.
s[ s <= 5000000 ][ s >= 2500000 ]

부산    3448737
인천    2890451
dtype: int64

In [ ]:
#딕셔너리 객체로 시리즈 생성.  2010년 인구데이터
#딕셔너리 넣으면 키가 인덱스가 된다. 값은 시리즈의 값이 되고. 

data = {'서울': 9631482, '부산': 3393191, '인천': 2632035, '대전': 1490158}
s2 = pd.Series(data) #키가 인덱스가 되고, 값은 시리즈의 값이 됨. #Series는 리스트도 받고 딕셔너리도 받네?
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [ ]:
# 2015년도와 2010년도의 인구 증가를 계산해보자.
#s와 s2 데이터가 있다
#s2가 2010이다
print(s)
print(s2)
ds = s - s2
ds

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [ ]:
#대구와 대전은 안보고 싶잖아. Nan으로 나오니까
ds.notnull() #T F로 구분해줌. Nan이 아닌 애들만 True로. 그럼 이걸 조건에 넣어서
ds[ ds.notnull() ] #조건을 쓰는 게 불린 인덱스임. 불린은 조건식 쓰는 거랑 같으니까 그렇게 생각해도 돼!

#이건 Nan만 보고 싶을 때 ㅋㅋ
ds.isnull()
ds[ ds.isnull() ]

대구   NaN
대전   NaN
dtype: float64

In [ ]:
# 2015년도와 2010년도의 인구 증가율(%)을 계산해보자.
# s와 s2 데이터가 있다
# s2가 2010이다

# 증감율 공식
# (비교대상 - 기준) / 기준 * 100
rs = (s - s2) / s2 * 100
rs[ rs.notnull() ]

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [ ]:
#나중에 대전과 대구에 값을 넣고 싶어졌다면?

rs['대구'] = 1.41 #딕셔너리에 값 넣는 거랑 같네. 키 지정하고 값 지정해가지구.
rs    #뭐 이런 식으로 바로 값을 넣고 바꿀 수 있음. 만약 지우고 싶다면 del 사용가능
del rs['서울'] #서울을 삭제시키기


# 자 지금까지 Series는 1차원이었고.. 이제 2차원 가보자

대구    1.410000
대전         NaN
부산    1.636984
인천    9.818107
dtype: float64

### DataFrame

In [ ]:
# DataFrame 생성
data = {"2015": [9904312, 3448737, 2890451, 2466052],
        "2010": [9631482, 3393191, 2632035, 2431774]} #확실히 데이터프레임 들어오자마자 나오는게 키:값쌍으로 받는데 키 이름을 열에 넣네. 열중심이 맞네.

#여기서는 값 부분이 리스트로 들어가져 있다. 
df = pd.DataFrame(data)
df  #보통 데이터프레임을 df라고 많이 부름.
    # 2015랑 2010이 각각의 시리즈다. 알겠지? 
    #원래 표 모양 유지시키면서 출력하고 싶으면 print()말고
display(df) #표모양
print(df)   #텍스트 모양

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [ ]:
#DataFrame 인덱스 수정
#이것도 리스트로 수정하면 됨
df.index = ['서울','부산','인천','대구']
df
#뭔가 합치거나 할 때는 인덱스가 동일하면 돼.

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [ ]:
# DataFrame 인덱스 지정하여 생성
#바로 생성할 때 인덱스를 넣어줄 수도 있음.

data = [[9904312, 3448737, 2890451, 2466052],   # 이렇게 2줄 그대로 들어갈 거임. 층에 2015와 2010, 호에 col 들어갈 거임.
        [9631482, 3393191, 2632035, 2431774]]
ind = ['2015', '2010']
col = ['서울','부산','인천','대구']

#생성할 때 값 바꾸는 게 제일 편하긴 함ㅋㅋ. 
df2 = pd.DataFrame(data, index = ind, columns = col)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [ ]:
#이걸 세워서 쓰고 싶다면 전치행렬 쓰면 됨!
df2.T
#방향은 바로 전환해서 사용하면 되기 때문에 뭐 방향은 특별한 이슈 없음.

#### Pandas 연습 02
DataFrame을 이용하여 아래와 같은 결과를 구성하시오.

| |홍길동|	김사또|	임꺽정|
|---|---|---|---|
|키|	175.3|	180.2|	178.6|
|몸무게|	66.2|	78.9|	55.1|
|나이|	27.0|	49.0|	35.0|

In [ ]:
#??? 대체 뭐가 다른 거지 걍 똑같은데 ㅋㅋㅋ

data = [[175.3, 180.2, 178.6],
        [66.2, 78.9, 55.1],
        [27.0, 49.0, 35.0]]

'''
[[175.3, 180.2,178.6],
 [66.2, 78.9, 55,1],
 [27.0, 49.0, 35.0]]
'''

ind = ['키','몸무게','나이']

col = ['홍길동','김사또','임꺽정']

df3 = pd.DataFrame(data, index=ind, columns=col)
df3

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

In [ ]:
data = [[175.3, 180.2, 178.6],
        [66.2, 78.9, 55.1],
        [27.0, 49.0, 35.0]]
ind = ['키', '몸무게', '나이']
col = ['홍길동','김사또','임꺽정']

df3 = pd.DataFrame(data, index=ind, columns=col)
df3

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

In [ ]:
data = [[175.3, 180.2, 178.6],
        [66.2, 78.9, 55.1],
        [27.0, 49.0, 35.0]]

ind = ['키','몸무게', '나이']
col = ['홍길동','김사또','임꺽정']


df3 = pd.DataFrame(data, index=ind, columns=col)
df3

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

In [ ]:
#홍길동 3회차
import pandas as pd

data = [[175.3, 180.2, 178.6],
        [66.2, 78.9, 55.1],
        [27.0, 49.0, 35.0]]

ind = ['키','몸무게', '나이']
col = ['홍길동','김사또','임꺽정']

df3 = pd.DataFrame(data, index=ind, columns=col)
df3

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

#### DataFrame

In [ ]:
 # 값 확인
 print(df.values)
 # 인덱스 확인
 print(df.index)
 # 컬럼 확인
 print(df.columns)

[[9904312 9631482]
 [3448737 3393191]
 [2890451 2632035]
 [2466052 2431774]]
Index(['서울', '부산', '인천', '대구'], dtype='object')
Index(['2015', '2010'], dtype='object')

In [ ]:
# DataFrame 열을 가져오고 싶다면!
df['2015']  #얘는 행이 아니라 열이 먼저 기준이 돼서 가져옴. 이렇게 가지고 온 곳에서 서울만 갖고 오고 싶다면
df['2015']['서울']    #열에 먼저 접근하고 행에 접근해야돼
#df['서울']  #이건 에러가 뜸. 왜냐면 열에 먼저 접근 안하고 행에 먼저 접근해서. 

df[ ['2010','2015'] ] #pd는 열이 먼저 기준이야. 항상 시리즈 단위로 먼저 옴. 열 단위로 먼저 접근한다는 것만 차이다. 열 중심인 게 약간의 혼선임.

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [ ]:
# "2005" 라는 컬럼명으로 2005년 인구수 대입
# 2005년을 추가하고 싶다!

data_2005 =  [9762546, 3512547, 2517680, 2456016]

#df['2005'] = [9762546, 3512547, 2517680, 2456016]   #키값쌍 만드는 것처럼 2005라는 열을 만들고 값을 넣어줌.
#df      #DataFrame에서는 열 방향 위주니까.. 아마 계속 헷갈릴거임 ㅋㅋㅋ

df['2005'] = data_2005 #딕셔너리 키:값 쌍 넣는 것처럼 넣어주면 돼~
df

     지역     2015       2010     2005     2000
도시
서울  수도권  9904312  9631482.0  9762546  9853972
부산  경상권  3448737        NaN  3512547  3655437
인천  수도권  2890451  2632035.0  2517680  2466338
대구  경상권  2466052  2431774.0  2456016  2473990

In [ ]:
#인덱싱! 값 접근하기!
#슬라이싱을 사용할 때는 행단위로 됨ㅋㅋ ㅠㅠ이게 대체 뭐얌 ㅠㅠ 아하! 그래서 범위 쓸 때 loc 사용 권장이잖아! loc은 ndarray랑 마찬가지로 행부터 시작하니까~

df[0:1]   #열단위 아니었나? 이건 행단위 아님? 하지만, 범위 슬라이싱 했을 때는 서울만 오게 됨.
#df['서울'] #이렇게 하나만 쓸 때는 열 단위임.. 서울만 넣어놓으면 오류 떠 
df['서울':'인천'] #근데 이렇게 범위 지정을 해주면 또 행단위로 나와.

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

In [ ]:
#boolean 인덱싱. 불린 인덱싱은 그거잖아. 조건식 넣기.

df['2010'] > 2500000
df[ df['2010'] > 2500000 ] #250만 이상인 것만 이렇게 나오게 됨.

#2010년도를 기준으로 250만명 이상인 것을 가져오겠다. 2010으로 국한하겠다.
df[ '2010' ][ df['2010'] > 2500000 ] #이렇게 하면 2010년도만 출력함. #여기서도 지금 봐야하는게 열중심이라서 열만 뽑아쓰고 있음.

#괄호가 많아서 혼란스러울 뿐이야... 이건 진짜 좀 그렇긴 하네.

서울    9631482
부산    3393191
인천    2632035
Name: 2010, dtype: int64

#### loc, iloc 인덱서

In [ ]:
# loc[] - 실제 인덱스를 사용하여 행을 가지고 올 때 사용
# df.loc[행, 열]

#범위할 때는 명확하게 하자! 이런 의미로 인덱서가 생겼음.
#이거 사용 많이 하라고 권장함. 

# [행 부분, 열 부분] 
# 서울부터 부산까지, 15년도부터 10년도까지
df.loc['서울':'부산', '2015':'2010']  #그래 이거지. 이게 나라다~ 행 - 열

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

In [ ]:
# iloc[] - numpy의 array인덱싱 방식으로 행을 가지고 올 때 사용
#판다스 내부는 넘파이로 이루어져있어서, 넘파이로 모든 걸 할 수도 있음 ㅋㅋ 다만 코드가 좀 길어질 뿐.

#ndarray 쓰는 거랑 진짜 똑같다!
#위랑 똑같이 서울부터 부산까지, 2015부터 2010까지 쓸 수 있음.
df.iloc[:2,:2]

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

#### csv 파일-1

population_number.csv

In [ ]:
#값 가져올 때
df = pd.read_csv(drive_path + 'population_number.csv', #pd.read_csv도 있고 excel도 있고... 온갖 것들이 있다. 지금은 csv 파일 가져오겠음! 
                 index_col='도시', encoding='euc-kr')  #여기서는 인덱스를 도시로 잡았다. 첫번째 줄에 컬럼(열) 설명이 들어있다. 인코딩은 문자를 어떻게 저장할 것이냐. 이건데, 한글 파일이 깨지면
                                                       #인코딩 문제를 확인해보자.

df

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [ ]:
# value_counts 함수
# - 값이 숫자, 문자열, 카테고리 값인 경우에 각각의 값이 나온 횟수를 셀 수 있다.
import numpy as np

s = pd.Series(np.random.randint(6, size = 100))
print(s.value_counts()) #각각의 숫자들이 몇번 등장하는지 알고 싶다면! 진짜 많이 쓰는 함수중 하나임. .value_counts()

#s를 앞부분에서 3개만 보고 싶다
s.head(3)
#s를 뒷부분에서 3개만 보고 싶다
s.tail(3)

2    23
1    22
5    19
4    14
3    11
0    11
dtype: int64

0    1
1    1
2    1
dtype: int64

In [ ]:
df.count() #빈도수 체크..

지역      4
2015    4
2010    3
2005    2
2000    4
dtype: int64

In [ ]:
#중복 데이터 있는지 확인해볼까
df['2015'].value_counts()

2466052    1
2890451    1
3448737    1
9904312    1
Name: 2015, dtype: int64

In [ ]:
# 정렬
# sort_index 함수 : 인덱스 값을 기준으로 정렬한다.
# sort_values 함수 : 데이터 값을 기준으로 정렬한다.

#값만 한번 정렬해볼까? 어느 인구가 가장 많은지!
df
df['2010']
df['2010'].sort_values()  #들어있는 데이터를 기준으로 소팅한 것.

#df['2010'].sort_values(ascending = True)  이건 뭐여 ㅋㅋ 강사님도 모르네

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

In [ ]:
# DataFrame을 2010년 인구수 기준으로 정렬
#df['2010'].sort_values() 이거와 똑같이 사용할 수 있는 게 있는데,

df.sort_values(by = '2010')
df.sort_values(by = '2010', ascending= False) #이렇게 하면 2010년을 기준으로 가장 많은 것부터 정렬됨. 내림차순 정렬

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437

In [ ]:
# DataFrame을 지역, 2010년 인구수 기준으로 정렬
df.sort_values(by = ['지역','2010']) #여러개를 주고 싶으면, 1차 소팅 2차 소팅 이런 식으로 정렬되는 거임. 정렬조건을 여러개 줄 수 있다는 거!!!

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

#### csv 파일-2

score.csv

In [ ]:
#csv 파일 불러오기 2회차, 과목으로 인덱싱 넣어보자

score = pd.read_csv( drive_path + 'score.csv', index_col = '과목', encoding='euc_kr' )
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [ ]:
score = pd.read_csv(drive_path + 'score.csv', encoding='euc_kr') #인코딩 문제 생기면 인코딩 옵션 추가해서 'euc-kr'
score

#과목으로 인덱싱 넣어보자
#score = pd.read_csv(drive_path + 'score.csv',
 #                   index_col = '과목',encoding='euc_kr') #인코딩 문제 생기면 인코딩 옵션 추가해서 'euc-kr'
score

   과목  1반  2반  3반  4반
0  수학  45  44  73  39
1  영어  76  92  45  69
2  국어  47  92  45  69
3  사회  92  81  85  40
4  과학  11  79  47  26

In [ ]:
# 학급별 총계
#총계라는 건 합이잖아. sum()~

#내 생각엔 다 학급별로 다 더해줘야할듯. 층들끼리 다 더해야하는 그런 느낌.

#score.sum() #열 단위로 합계를 구해줘... 1반 2반 3반 4반 이런 식으로. 이건 0번 축으로 한다는 거임. 
display(score.sum())

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [ ]:
#학급별 총계 2회차
#학급별 총계라는 건 행방향으로 하는 것 같그등여~? 
score.loc[:,:].sum() #지금 이미 0축이라 딱히 건드릴 게 없네? 굳이 한번 더 써보자면~ axis=0으로 지정해주는 것 정도?
score.loc[:,:].sum(axis=0)

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [ ]:
##학급별 총계 3회차

#학급별 총계라는 건, 행방향으로 sum()이네?
score.loc[ :,: ].sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [ ]:
##학급별 총계 4회차

#판다스는 열중심, 그냥 불러오면 됨. 그리고 학급별 통계는 방향이 행방향. axis = 0

score.sum(axis = 0)

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [ ]:
##학급별 총계 5회차

score.sum(axis = 0)

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [ ]:
# 학급별 순위

#학급별 총계를 구했으면, 가장 합계가 높은 녀석을 기준으로 sort하면 되겠다!

s = score.sum()
s.sort_values(ascending=False)
#score.sum().sort_values(ascending = False) #오름차순으로 나옴. 이걸 어센딩으로 내림차순으로 바꾸자.

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [ ]:
#학급별 순위 2회차
#.sort_values() 함수를 쓰려고 하는데영~~ 맞나염??
s = score.loc[:,:].sum(axis=0) 
s.sort_values() #이렇게 그냥 뽑으면 오름차순이거든? 난 근데 내림차순으로 할 꼬임~ 그럴려면
s.sort_values(ascending=False) #ascending이 단어가 오름차순임 ㅋㅋㅋㅋ 이거 False로 하면 당연히 내림차순 되는 거

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [ ]:
##학급별 순위 3회차 점수 높은 순서대로
#sort_values() 함수 쓸게여!!

s = score.sum()
s.sort_values(ascending=False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [ ]:
##학급별 순위 4회차 점수 높은 순서대로

#학급별 순위 점수 높은대로면. sum(axis = 0) 하고 sort_values하고 여기에 어센딩을 넣는군

score.sum(axis = 0).sort_values(ascending=False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [ ]:
##학급별 순위 4회차 점수 높은 순서대로

score.sum(axis = 0).sort_values(ascending = False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [ ]:
# 과목별 총계
#과목별로 합계를 구하고 싶다면..
#아까는 열단위였으니까 이건 행단위로 뽑아내면 된다. 축을 바꿔서 뽑으면 됨. 0방향으로 뽑았으니까 1방향으로 뽑아내면?

#score.sum(axis = 1) #0방향이었던 축을 1방향으로 뽑아낸 것!
#score.sum(axis = 1).sort_values(ascending=False) #이건 과목별로 내림차순 시킨 것! 

#score.sum() 이거는 아까 열 단위였잖아. 과목별 총계는 행단위니까 행단위로 뽑아내려면
score.sum(axis = 1).sort_values(ascending=False)

과목
사회    298
영어    282
국어    253
수학    201
과학    163
dtype: int64

In [ ]:
#과목별 총계 2회차
#아까 s 하던 이거는 axis=0이었다. 근데 이번에는 방향축이 호단위 거든요? 층이 아니라? 아 그래서! axis=1로 바꿔줄 꼬에요~

score.loc[:,:].sum(axis=1) #이러면 이제 과목별로 나오지??

과목
수학    201
영어    282
국어    253
사회    298
과학    163
dtype: int64

In [ ]:
#과목별 총계 3회차
#과목별은 호방향. axis = 1
score.sum(axis = 1)

과목
수학    201
영어    282
국어    253
사회    298
과학    163
dtype: int64

In [ ]:
##과목별 총계 4회차
#과목별 총계는 행 단위잖소? axis = 1만 해주면 돼~

score.sum(axis=1)

과목
수학    201
영어    282
국어    253
사회    298
과학    163
dtype: int64

In [ ]:
##과목별 총계 5회차

#이건 행방향

score.sum(axis=1)

과목
수학    201
영어    282
국어    253
사회    298
과학    163
dtype: int64

In [ ]:
# 과목별 합계를 DataFrame에 추가

#이게 시리즈니까 시리즈에 넣어주면 되겠지~
score['합계'] = score.sum(axis=1)    #score에 합계라는 열을 만들어서 넣겠다!
score

#합계 삭제할 때는 이렇게 또 삭제시켜서 원래대로 되돌릴 수가 있음.
del score['합계']

In [ ]:
# 과목별 합계를 DataFrame에 추가 2회차

#자 일단 열부분에 합계가 새로 들어갔다. 이거 열 단위라서 그냥 넣으면 열로 들어가거든?
#score['합계'] = [ 과목별 합계 넣어주면 됨 ] 
score['합계'] = score.loc[:,:].sum(axis=1)
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [ ]:
# 과목별 합계를 DataFrame에 추가 3회차

#열 부분에, 과목별 합계가 들어갔군.

score['합계'] = score.sum(axis = 1)
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [ ]:
# 과목별 합계를 DataFrame에 추가 4회차

score['합계'] = score.sum(axis=1)
score

    1반  2반  3반  4반     합계
과목
수학  45  44  73  39  201.0
영어  76  92  45  69  282.0
국어  47  92  45  69  253.0
사회  92  81  85  40  298.0
과학  11  79  47  26  163.0

In [ ]:
# 과목별 합계를 DataFrame에 추가 5회차

score['합계'] = score.sum(axis=1)
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [ ]:
#score.max() 이게 축별로 다 나옴.
score.max(axis = 1) #어떤 축으로 할 것이냐에 따라 달라짐
score.min()
score.mean()

1반     54.2
2반     77.6
3반     59.0
4반     48.6
합계    239.4
dtype: float64

#### Pandas 연습 03-1

과목별 평균을 계산하여 column 추가하기
```

        1반  2반	3반	4반	합계	평균
과목						
수학	45	44	73	39	201	50.25
영어	76	92	45	69	282	70.50
국어	47	92	45	69	253	63.25
사회	92	81	85	40	298	74.50
과학	11	79	47	26	163	40.75
```

In [ ]:
#내가 푼 것.
score = pd.read_csv(drive_path + 'score.csv',
                    index_col = '과목',encoding='euc_kr') #인코딩 문제 생기면 인코딩 옵션 추가해서 'euc-kr'
score

#각 과목별 총합
sub_sum = score.sum(axis=1)

score['합계'] = sub_sum # 칼럼에 합계 추가하고 각 과목 합계
score

#각 과목별 평균
sub_mean = sub_sum/4
sub_mean
#여기서 .mean() 이거 활용하는 게 궁금한데. 이거 어떻게 활용해야하지?

score['평균'] = sub_mean
score

    1반  2반  3반  4반   합계     평균
과목
수학  45  44  73  39  201  50.25
영어  76  92  45  69  282  70.50
국어  47  92  45  69  253  63.25
사회  92  81  85  40  298  74.50
과학  11  79  47  26  163  40.75

In [ ]:
#과목별 평균을 계산하여 column 추가하기 2회차
#열 끝부분에 과목별 평균을 넣어주길 원함.
score = pd.read_csv(drive_path + 'score.csv',
                    index_col = '과목',encoding='euc_kr') #인코딩 문제 생기면 인코딩 옵션 추가해서 'euc-kr'
score
#계산은 호단위 알져?
#과목별 평균 구하기
score_mean = score.mean(axis=1)
score_mean

score['합계'] = score_mean
score

    1반  2반  3반  4반     합계
과목
수학  45  44  73  39  50.25
영어  76  92  45  69  70.50
국어  47  92  45  69  63.25
사회  92  81  85  40  74.50
과학  11  79  47  26  40.75

In [ ]:
#과목별 평균을 계산하여 column 추가하기 3회차

#열 단위라 걍 추가하면 쭉 들어가거든?
score.mean(axis = 1)
score['평균'] = score.mean(axis = 1) #과목별 평균
score

    1반  2반  3반  4반     평균
과목
수학  45  44  73  39  50.25
영어  76  92  45  69  70.50
국어  47  92  45  69  63.25
사회  92  81  85  40  74.50
과학  11  79  47  26  40.75

In [ ]:
#과목별 평균을 계산하여 column 추가하기 4회차

#평균 추가해주고, 

#score[ :'4반' , '과학' ] #열 중심이라 열 먼저 들어감.
score['평균'] = score.loc[ :'과학' , :'4반' ].mean(axis = 1)
score

    1반  2반  3반  4반     합계     평균
과목
수학  45  44  73  39  201.0  50.25
영어  76  92  45  69  282.0  70.50
국어  47  92  45  69  253.0  63.25
사회  92  81  85  40  298.0  74.50
과학  11  79  47  26  163.0  40.75

In [ ]:
#과목별 평균을 계산하여 column 추가하기 5회차

score['평균'] = score.loc[:'과학',:'4반'].mean(axis = 1)
score

    1반  2반  3반  4반   합계     평균
과목
수학  45  44  73  39  201  50.25
영어  76  92  45  69  282  70.50
국어  47  92  45  69  253  63.25
사회  92  81  85  40  298  74.50
과학  11  79  47  26  163  40.75

In [ ]:
#iloc을 활용한 힌트. iloc은 ndarray랑 마찬가지로 범위 슬라이싱 하는 건데. 2반까지 불러온다면
score.iloc[:,:'2반']

In [ ]:
#강사님이 풀어준 것

score = pd.read_csv(drive_path + 'score.csv',
                    index_col = '과목',encoding='euc_kr') #인코딩 문제 생기면 인코딩 옵션 추가해서 'euc-kr'

score.loc[:,:'4반'] #이거 자체가 시리즈임. 층은 전체고, 호는 4반까지 쓰겠다. 근데 그냥 하면 0축이니까 이걸 1축으로 바꿔줘야함. 이건 범위라 열우선이 아님! 여기다 .mean() 하면 반별로 나옴

score['평균'] = score.loc[:,:'4반'].mean(axis=1) #4반까지 평균 구한 거!!!
score

    1반  2반  3반  4반     평균
과목
수학  45  44  73  39  50.25
영어  76  92  45  69  70.50
국어  47  92  45  69  63.25
사회  92  81  85  40  74.50
과학  11  79  47  26  40.75

#### Pandas 연습 03-2

반평균을 계산 하여 row 추가 하기
```
	      1반	2반	 3반 	4반 	합계	평균
과목						
수학	45.0	44.0	73.0	39.0	201.0	50.25
영어	76.0	92.0	45.0	69.0	282.0	70.50
국어	47.0	92.0	45.0	69.0	253.0	63.25
사회	92.0	81.0	85.0	40.0	298.0	74.50
과학	11.0	79.0	47.0	26.0	163.0	40.75
반평균  54.2	77.6	59.0	48.6	239.4	59.85
```

In [ ]:
#반평균을 계산 하여 row 추가 하기 5회차

score.loc[ '반평균' ] = score.loc[:'과학',:].mean(axis = 0)
score

       1반    2반    3반    4반     합계     평균
과목
수학   45.0  44.0  73.0  39.0  201.0  50.25
영어   76.0  92.0  45.0  69.0  282.0  70.50
국어   47.0  92.0  45.0  69.0  253.0  63.25
사회   92.0  81.0  85.0  40.0  298.0  74.50
과학   11.0  79.0  47.0  26.0  163.0  40.75
반평균  54.2  77.6  59.0  48.6  239.4  59.85

In [ ]:
#반평균을 계산 하여 row 추가 하기 4회차

score.loc[:'과학',:].mean(axis=0)
score.loc['반평균'] = score.loc[:'과학',:].mean(axis=0)
score

       1반    2반    3반    4반     합계     평균
과목
수학   45.0  44.0  73.0  39.0  201.0  50.25
영어   76.0  92.0  45.0  69.0  282.0  70.50
국어   47.0  92.0  45.0  69.0  253.0  63.25
사회   92.0  81.0  85.0  40.0  298.0  74.50
과학   11.0  79.0  47.0  26.0  163.0  40.75
반평균  54.2  77.6  59.0  48.6  239.4  59.85

In [ ]:
#행 추가하는 법

score.loc['반평균'] #이렇게 하면 행 추가. 여기다 = 어쩌고 해서 어떤 걸 넣겠다 하면 행이 추가된다. 이건 loc이니까 열 우선이 아님!

In [ ]:
#반평균 계산해서 row 추가 2회차
score.mean(axis=0)

score.loc['반평균'] = score.mean(axis=0) #score.loc[] 해서 값 추가하는 거 진짜 개꿀팁
score

       1반    2반    3반    4반     합계
과목
수학   45.0  44.0  73.0  39.0  50.25
영어   76.0  92.0  45.0  69.0  70.50
국어   47.0  92.0  45.0  69.0  63.25
사회   92.0  81.0  85.0  40.0  74.50
과학   11.0  79.0  47.0  26.0  40.75
반평균  54.2  77.6  59.0  48.6  59.85

In [ ]:
#반평균을 계산 하여 row 추가 하기 3회차
#score = pd.read_csv(drive_path + 'score.csv', index_col = '과목',encoding='euc_kr') #인코딩 문제 생기면 인코딩 옵션 추가해서 'euc-kr'
#score
#score['합계'] = score.sum(axis = 1)
#score['평균'] = score.loc[:, :'4반'].mean(axis = 1)
#score
score.loc['반평균'] = score.loc[:,:].mean(axis=0) #행 추가할 때 .loc해서 행추가하는 거 진짜 좋은 생각이다.
score

       1반    2반    3반    4반     합계     평균
과목
수학   45.0  44.0  73.0  39.0  201.0  50.25
영어   76.0  92.0  45.0  69.0  282.0  70.50
국어   47.0  92.0  45.0  69.0  253.0  63.25
사회   92.0  81.0  85.0  40.0  298.0  74.50
과학   11.0  79.0  47.0  26.0  163.0  40.75
반평균  54.2  77.6  59.0  48.6  239.4  59.85

In [ ]:
#강사가 풀어준 것
score.loc['반평균'] = score.mean()
score

       1반    2반    3반    4반     평균
과목
수학   45.0  44.0  73.0  39.0  50.25
영어   76.0  92.0  45.0  69.0  70.50
국어   47.0  92.0  45.0  69.0  63.25
사회   92.0  81.0  85.0  40.0  74.50
과학   11.0  79.0  47.0  26.0  40.75
반평균  54.2  77.6  59.0  48.6  59.85

#### Pandas 연습 03-3

반 평균, 합계, 평균을 제외한 데이터 중 과목별 가장 큰 값, 작은 값을 구하시오.

```
과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64
```
```
과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64
```

In [ ]:
##반 평균, 합계, 평균을 제외한 데이터 중 과목별 가장 큰 값, 작은 값을 구하시오. 5회차
score.loc[:'과학',:'4반'].max(axis = 1)

score.loc[:'과학',:'4반'].max(axis = 1)

과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64

In [ ]:
##반 평균, 합계, 평균을 제외한 데이터 중 과목별 가장 큰 값, 작은 값을 구하시오. 4회차

#과목별 가장 큰 거 - 그 뭐냐? 행 단위로.
score.loc[:'과학',:'4반'].max(axis = 1)

#과목별 가장 작은 거 - 그 뭐냐? 행 단위로.
score.loc[:'과학',:'4반'].min(axis = 1)

과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64

In [ ]:
#범위 연산자 사용해서 가장 큰 값과 가장 작은 값 찾기
score
#iloc는 '이름' 이름으로 쓰면 안되고, 인덱스 숫자를 써야만 가능함. loc은 이름 쓰기 가능
#loc[,] loc으로 슬라이싱하는 게 진짜 좋네. 
display(score.loc[:'과학',:'4반'].max(axis=1)) #왜 축을 1열로 바꿨냐 하면.. 층끼리(반끼리) 제일 큰 게 아니라 호끼리(과목끼리) 제일 큰 거를 출력하려 했기 때문임.
display(score.loc[:'과학',:'4반'].min(axis=1))

과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64

과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64

In [ ]:
#범위 연산자 사용해서 가장 큰 값과 가장 작은 값 찾기 2회차
score

#일단 나는~ 과목별 제일 큰 값, 작은 값이니까 max(), min() 써야하는데, 과목별이면 axis=1이잖아? 이걸 갖고 가보자
score.min(axis=1)
score.max(axis=1)

#근데 이렇게만 풀지 말고 .loc[] 써서 풀어보자
max_arr = score.loc[:'과학' , :'4반'].max(axis=1)
max_arr
min_arr = score.loc[:'과학',:'4반'].min(axis=1) #축 지정 해줘야돼. .loc[,]은 ndarry가 익숙하니까 그거대로 슬라이싱 하려고 하는 거야. 알겠지? axis는 늘 표기해주도록 하자.
                                                #특히 판다스같은 경우는 열중심이라 그냥 하면 헷갈려. .loc[,] 쓰고, 끝에 함수에 축지정까지 잊지마~~
min_arr

1반    11.0
2반    44.0
3반    45.0
4반    26.0
dtype: float64

In [ ]:
#반 평균, 합계, 평균을 제외한 데이터 중 과목별 가장 큰 값, 작은 값을 구하시오. 3회차
score #과목별 가장 큰값, 작은 값. max()하고 min()

#과목별이면 호별임. axis = 1

score.loc[:'과학',:'4반'].max(axis = 1)

#score.loc[].min(axis = 1)

과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64

In [ ]:
#강사님이 풀어준 것

max_arr = score.loc[:'과학',:'4반'].max(axis=1)
min_arr = score.loc[:'과학',:'4반'].min(axis=1)

#iloc 사용한다면? iloc은 숫자 인덱스 범위임. 근데 loc이 훨씬 직관적이지 않냐? 그냥 알아서 편한 거 사용하면 됨!
score.iloc[:5,:4]

      1반    2반    3반    4반
과목
수학  45.0  44.0  73.0  39.0
영어  76.0  92.0  45.0  69.0
국어  47.0  92.0  45.0  69.0
사회  92.0  81.0  85.0  40.0
과학  11.0  79.0  47.0  26.0

#### Pandas 연습 03-4

과목별 가장 큰 값과 작은 값의 차를 구하시오.
```
과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64
```

In [ ]:
#그냥 앞에서 한 거 2개 빼면 됨 ㅠㅠ 위에 거 해놓으면 너무 쉬워..
max_arr = score.loc[:'과학',:'4반'].max(axis=1)
min_arr = score.loc[:'과학',:'4반'].min(axis=1)

max_arr - min_arr

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

#### apply 변환

행이나 열 단위로 더 복잡한 처리를 하고 싶을 때 사용
```
DataFrame.apply( func, axis = 0)
```

In [ ]:
#제공되고 있지 않은 것도 함수로 만들어서 쓸 수 있음. 
score 

#각 과목별 가장 큰 값과 가장 작은 값의 차

       1반    2반    3반    4반     평균
과목
수학   45.0  44.0  73.0  39.0  50.25
영어   76.0  92.0  45.0  69.0  70.50
국어   47.0  92.0  45.0  69.0  63.25
사회   92.0  81.0  85.0  40.0  74.50
과학   11.0  79.0  47.0  26.0  40.75
반평균  54.2  77.6  59.0  48.6  59.85

In [ ]:
#각 과목별 가장 큰 값과 가장 작은 값의 차
#이걸 apply 적용해서 처리할 수도 있음.

def max_min(x):
  return x.max() - x.min()

score.loc[:'과학',:'4반'].apply(max_min, axis=1)

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

In [ ]:
#apply 활용 2회차

def max_min(x):
  return x.max() - x.min()

score.loc[:'과학',:'4반'].apply(max_min, axis=1)

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

In [ ]:
#apply 활용 3회차

def max_min(x):
  return x.max() - x.min()

score.loc[:'과학',:'4반'].apply( max_min, axis = 1 )

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

In [ ]:
#같은 거를 람다식으로 쓰면
score.loc[:'과학', :'4반'].apply(lambda x: x.max() - x.min(), axis=1)
#이건데 이걸 어떻게 하냐 지금 ㅋㅋㅋㅋㅋ

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

In [ ]:
####pd.value_counts를 해보자.이때까지는 몰랐다. 이 녀석이 제일 중요할 줄은 
data_dic = {"A":[1,3,3,4,4], "B":[1,2,2,3,3], "C":[1,2,4,4,5]}
df4 = pd.DataFrame(data_dic)
df4

df4.apply(pd.value_counts) #몇번 등장했는지 쉽게 비교할 수 있는 뭐 그런 거라는데...

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [ ]:
#pd.value_counts를 해보자 2회차
data_dic = {"A":[1,3,3,4,4], "B":[1,2,2,3,3], "C":[1,2,4,4,5]} #자 이 딕셔너리 키 값을 그거로 넣어줄 거야. pd.DataFrame으로 넣어줄 거임!
df4 = pd.DataFrame( data_dic )
df4

#자 그다음에 pd.value_counts()를 할건데..
df4.apply(pd.value_counts) #몇번 등장했는지 쉽게 비교할 수 있는 뭐 그런 거라는데...
#apply(func, axis) apply 이 어플라이라는 건 그거같아. 함수를 자동적용 시켜주는? 그런 느낌?

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [ ]:
df5 = df4.apply(pd.value_counts)
df5.fillna(0) #결측치 처리할 때 nan 부분을 다 0으로 채워넣음.

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

#### 카테고리

In [ ]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"] #구간이니까 요소 개수가 하나 적을 수 밖에!

#이것도 사실 자료형임. 카테고리 자료형. 
#카테고리는 판다스에 cut라고 있음.
#카테고리는 자주 쓴다...

cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [ ]:
#카테고리 2회차
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
bins = [0, 15, 25, 35, 60, 99]
age_tag = ["미성년자", "청년", "중년", "장년", "노년"] #구간이니까 요소 개수가 하나 적을 수 밖에!

dogs = pd.cut(ages, bins, labels=age_tag)
dogs #주어진 데이터를 카테고리화 시켰고, 그 다음에 이걸 칼럼추가 해야되는구나.

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [ ]:
#카테고리 3회차
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
bins = [0, 15, 25, 35, 60, 99]
age_tag = ["미성년자", "청년", "중년", "장년", "노년"]

age_cut = pd.cut(ages, bins, labels=age_tag)
age_cut.value_counts()

미성년자    2
청년      3
중년      2
장년      2
노년      1
dtype: int64

In [ ]:
#카테고리 3회차
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
bins = [0, 15, 25, 35, 60, 99]
age_tag = ["미성년자", "청년", "중년", "장년", "노년"]

age_cuts = pd.cut(ages, bins, labels=age_tag)
age_cuts.value_counts()

미성년자    2
청년      3
중년      2
장년      2
노년      1
dtype: int64

In [ ]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [ ]:
age_df = pd.DataFrame(ages, columns=['ages'])
age_df['age_cat'] = cats  #카테고리 데이타에 바로 추가
age_df['age_cat'].value_counts() #몇번 나왔는지 확인

청년      3
장년      2
중년      2
미성년자    2
노년      1
Name: age_cat, dtype: int64

In [ ]:
#카테고리 추가하고 찾아보는거 2회차
dog_age_df = pd.DataFrame(ages, columns=['ages']) #이것도 칼럼추가, 
dog_age_df['age_dog'] = dogs #이것도 칼럼 추가. 아까부터 계속했던 그 키:값 넣듯이 넣은 거네.
print(dog_age_df)
dog_age_df['age_dog'].value_counts() #그 다음 이거는 그 라벨링 했던 거에 얼마나 들어가는지

    ages age_dog
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

청년      3
장년      2
중년      2
미성년자    2
노년      1
Name: age_dog, dtype: int64

#### Pandas 연습 04-1

1. 타이타닉호 승객 데이터(train.csv)를 데이터프레임으로 읽어 온다.

2. 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

```
Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64
```

In [5]:
###타이타닉 04-1 7회차
import pandas as pd
train = pd.read_csv( drive_path + 'train.csv',index_col='PassengerId' )
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [ ]:
###타이타닉 04-1 6회차
import pandas as pd


train = pd.read_csv( drive_path + 'train.csv', index_col='PassengerId' )
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [ ]:
###타이타닉 04-1 5회차

train = pd.read_csv( drive_path + 'train.csv',index_col='PassengerId' )
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [ ]:
###타이타닉 04-1 4회차

train = pd.read_csv(drive_path + 'train.csv', index_col='PassengerId')
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [ ]:
###타이타닉 04-1 3회차

train = pd.read_csv(drive_path + 'train.csv', index_col='PassengerId')
train

#승객 데이터의 데이터 개수를 각 열마다 구해본다. 보통 데이터 불러오면 불러오자마자 info()부터 하져?
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [ ]:
###타이타닉 04-1 2회차

##타이타닉호 승객 데이터(train.csv)를 데이터프레임으로 읽어 온다.
# 일단 가장 먼저 타이타닉 데이터 호출해야함. 그냥 출력해도 되는데, 난 인덱스 부분 PassengerId로 넣어줄 거임.
train = pd.read_csv(drive_path + 'train.csv', index_col='PassengerId') 
train
##타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
train.info() #info는 진짜 가장 많이 활용하는 것중 하나임.

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [ ]:
train = pd.read_csv( drive_path + 'train.csv' )
train #Pclass는 선실 등급. 인덱스 보면 그냥 숫자로 되어있는데, 이걸 난 로드할 때 인덱스 칼럼을 패신저 id로 줄게

train = pd.read_csv( drive_path + 'train.csv', index_col='PassengerId' )
train #데이터 내용이 너무 길 때, train.T 이렇게 전치행렬해서 바꿔서 보기도 함. 여기서 .head(3) 이런식으로 해서 상위 3개만 보거나 .tail(3)해서 하위 3개만 보거나 하는 걸 자주함.

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
...               ...     ...  ...   ...      ...
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[891 rows x 11 columns]

In [ ]:
#info 를 쓰면 간단한 정보를 보여줌
train.T.info
#train.info #데이터 수가 들어있음.

<bound method DataFrame.info of PassengerId                      1    ...                  891
Survived                           0  ...                    0
Pclass                             3  ...                    3
Name         Braund, Mr. Owen Harris  ...  Dooley, Mr. Patrick
Sex                             male  ...                 male
Age                               22  ...                   32
SibSp                              1  ...                    0
Parch                              0  ...                    0
Ticket                     A/5 21171  ...               370376
Fare                            7.25  ...                 7.75
Cabin                            NaN  ...                  NaN
Embarked                           S  ...                    Q

[11 rows x 891 columns]>

In [ ]:
train.describe() #통계치를 한번에 본다고 생각하면 됨. 통계설명

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

#### Pandas 연습 04-2

1. 타이타닉호 승객 중 성별(Sex) 인원수, 나이별(Age) 인원수, 선실별(Pclass) 인원수, 사망/생존(Survived) 인원수를 구하라.

In [6]:
##타이타닉 04-02 7회차

train[ 'Sex' ].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [ ]:
##타이타닉 04-02 5회차

#train[ ['Sex','Age','Pclass','Survived'] ].value_counts()

train[ 'Sex' ].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [ ]:
##타이타닉 04-02 4회차

train['Sex'].value_counts()
train['Age'].value_counts()
train['Pclass'].value_counts()
train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [ ]:
##타이타닉 04-02 3회차

#성별인원수 나이인원수 선실별인원수 사망생존인원수

#열중심인 거 기억하고!
train['Age'].value_counts()
train['Sex'].value_counts()
train['Pclass'].value_counts()
train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [ ]:
#타이타닉 04-02 2회차

##타이타닉호 승객 중 Sex, Age, Pclass, Survived 인원수 구해라 

train['Sex'].value_counts()
train[ ['Sex','Age'] ] #이렇게 하면 여러개 갖고 올 수 있다!

                Sex   Age
PassengerId
1              male  22.0
2            female  38.0
3            female  26.0
4            female  35.0
5              male  35.0
...             ...   ...
887            male  27.0
888          female  19.0
889          female   NaN
890            male  26.0
891            male  32.0

[891 rows x 2 columns]

In [ ]:
#타이타닉 04-02 2회차

##타이타닉호 승객 중 Sex, Age, Pclass, Survived 인원수 구해라

train.loc[:,'Sex'].value_counts()
train.loc[:,'Age'].value_counts()
train.loc[:,'Pclass'].value_counts()
train.loc[:,'Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [ ]:
#성별 인원수, 나이별 인원수, 선실별 인원수, 사망/생존 수 구하자
#이렇게 할 때 쓰는 게 value_counts()임. 몇번씩 나왔나.. 
#데이터 분석할 때는 분석 아이디어가 좀 필요함. ~~이 영향을 좀 주지 않았을까?? 하는 식.

print(train['Sex'].value_counts())
print(train['Age'].value_counts())
print(train['Pclass'].value_counts())
print(train['Survived'].value_counts())

male      577
female    314
Name: Sex, dtype: int64
24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64
3    491
1    216
2    184
Name: Pclass, dtype: int64
0    549
1    342
Name: Survived, dtype: int64

#### Pandas 연습 04-3

1. 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해  ‘미성년자‘, ‘청년‘, ‘중년‘, ‘장년‘, ‘노년’ 승객의 비율을 구하라.

(단, 그룹별 비율의 전체 합은 1이 되어야 한다.)
```
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
```

In [16]:
##타이타닉 04-03 7회차

bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

#생존자
#생존자로 나눠서 나이로 구분해야함
a = train[train[ 'Survived' ] == 1]['Age']
a_c = pd.cut( a, bins, labels=labels )
a_c.value_counts() /a_c.count()

중년      0.286207
장년      0.268966
청년      0.258621
미성년자    0.168966
노년      0.017241
Name: Age, dtype: float64

In [ ]:
##타이타닉 04-03 5회차

bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

#print(train)
#생존자
alive = train[train['Survived'] == 1]['Age']
alive

alive_cut = pd.cut(alive, bins, labels=labels)
alive_cut.value_counts()
alive_cut.value_counts()/alive_cut.count()

중년      0.286207
장년      0.268966
청년      0.258621
미성년자    0.168966
노년      0.017241
Name: Age, dtype: float64

In [ ]:
##타이타닉 04-03 4회차

bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

#생존자
alive = train[train['Survived'] == 1]

pd.cut(alive['Age'], bins, labels=labels).value_counts() #밸류 카운트 하는 이유. 중년 몇명 미성년자 몇명 청년 몇명인지 보기 위해

#사망자

중년      83
장년      78
청년      75
미성년자    49
노년       5
Name: Age, dtype: int64

In [ ]:
##타이타닉 04-03 4회차

#주어진 조건 힌트 보면 알겠지만 카테고리 쓰는 문제임.
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

#생존자 그룹
age_1 = train[train['Survived'] == 1]['Age']
age_1_cut = pd.cut(age_1, bins, labels=labels)
age_1_cut.value_counts()

#사망자 그룹
age_0 = train[train['Survived'] == 0]['Age']
age_0_cut = pd.cut(age_0, bins, labels=labels)
age_0_cut.value_counts()

청년      143
장년      117
중년      113
미성년자     34
노년       17
Name: Age, dtype: int64

In [ ]:
##타이타닉 04-03 3회차

#여기서는 카테고리 써야함ㅋㅋ

bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

#생존자 그룹
#일단 난 생존자부터 불린 인덱스 쓰고 싶음.
survivor = train[train['Survived'] == 1]
survivor.value_counts()

pd.cut(survivor['Age'], bins, labels=labels).value_counts()

#비율


#사망자 그룹
#이것도 불린인덱스 쓸 거임.
rip = train[train['Survived'] == 0] #인덱싱하는 것처럼 조건식 넣어주는 거라고 생각하자!
pd.cut(rip['Age'], bins, labels=labels).value_counts()

#비율


##########################

#만약에 여러개를 가져오고 싶다면?
  #이건 하나 가져온 거고

#팬시 인덱스 써서 여러개 가져오면 된다.
train[ ['Age','Sex'] ]

              Age     Sex
PassengerId
1            22.0    male
2            38.0  female
3            26.0  female
4            35.0  female
5            35.0    male
...           ...     ...
887          27.0    male
888          19.0  female
889           NaN  female
890          26.0    male
891          32.0    male

[891 rows x 2 columns]

In [ ]:
##타이타닉 04-03 2회차

#여기서는 카테고리 써야함ㅋㅋ

bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

#생존자 그룹
#일단 난 생존자부터 불린 인덱스 쓰고 싶음.
survivor = train[train.loc[:,'Survived'] == 1]
survivor_age = survivor.loc[:,'Age']
survivor_group = pd.cut(survivor_age, bins, labels=labels).value_counts()

#비율
print(survivor_group / pd.cut(survivor_age, bins, labels=labels).count()) #value_counts() / count()


#사망자 그룹
#이것도 불린인덱스 쓸 거임.
rip = train[train.loc[:,'Survived'] == 0]
rip_age = rip.loc[:,'Age']
rip_group = pd.cut(rip_age, bins, labels=labels).value_counts()

#비율
print(rip_group / pd.cut(rip_age, bins, labels=labels).count()) #value_counts() / count()


##########################

#만약에 여러개를 가져오고 싶다면?
train['Age']  #이건 하나 가져온 거고

#팬시 인덱스 써서 여러개 가져오면 된다.
train_p_s_s = train[ ['Pclass','Sex','Survived'] ] #단 여러개 가져올 때 리스트로 가져오는 거 잊지마~
train_p_s_s.info()

중년      0.286207
장년      0.268966
청년      0.258621
미성년자    0.168966
노년      0.017241
Name: Age, dtype: float64
청년      0.337264
장년      0.275943
중년      0.266509
미성년자    0.080189
노년      0.040094
Name: Age, dtype: float64

In [ ]:
# 생존자 그룹
train
train1 = train[train['Survived'] == 1]    #불린 활용해서 생존자 그룹 생성

train1

In [ ]:
# 생존자 그룹 카테고리화
#카테고리는 진짜 복습 잘 해야할듯ㅋㅋ

bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

train_1_cuts = pd.cut( train1['Age'], bins, labels = labels ) #카테고리화. 추출해서 비교해보고 싶은 것들은 원하는대로 뽑아올 수 있음!
train_1_cuts.value_counts()

중년      83
장년      78
청년      75
미성년자    49
노년       5
Name: Age, dtype: int64

In [ ]:
# 비율
train_1_cuts.value_counts() / train_1_cuts.count()

중년      0.286207
장년      0.268966
청년      0.258621
미성년자    0.168966
노년      0.017241
Name: Age, dtype: float64

In [ ]:
# 사망자 그룹
train0 = train[train['Survived'] == 0]
train0

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
5                   0       3  ...   NaN        S
6                   0       3  ...   NaN        Q
7                   0       1  ...   E46        S
8                   0       3  ...   NaN        S
...               ...     ...  ...   ...      ...
885                 0       3  ...   NaN        S
886                 0       3  ...   NaN        Q
887                 0       2  ...   NaN        S
889                 0       3  ...   NaN        S
891                 0       3  ...   NaN        Q

[549 rows x 11 columns]

In [ ]:
# 사망자 그룹 카테고리화
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

train_0_cuts = pd.cut(train0['Age'],bins, labels = labels)
train_0_cuts.value_counts()

청년      143
장년      117
중년      113
미성년자     34
노년       17
Name: Age, dtype: int64

In [ ]:
# 비율 #나이가 누락된 사람들이 있었기 때문에 수가 딱 떨어지진 않음.
train_0_cuts.value_counts() / train_0_cuts.count()

청년      0.337264
장년      0.275943
중년      0.266509
미성년자    0.080189
노년      0.040094
Name: Age, dtype: float64

In [ ]:
#만약에 여러개를 가져오고 싶다면?
train['Age']  #이건 하나 가져온 거고

#팬시 인덱스 써서 여러개 가져오면 된다.
train_p_s_s = train[ ['Pclass','Sex','Survived'] ]
train_p_s_s.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Pclass to Survived
Columns: 891 entries, 1 to 891
dtypes: object(891)
memory usage: 20.9+ KB

#### groupby

In [ ]:
#그룹 바이는 묶어주고 싶은 열들끼리 모아서, 연산처리를 하면 그 그룹 내부에 있는 것들끼리 연산이 진행됨. 
#그룹은 연습을 많이 해야 응용이 좀 될텐데. 어디다 써야하는지는 잘 안떠오름. 연습을 잘해줘야함!

df5 = pd.DataFrame({
    'key1':['A','A', 'B', 'B', 'A'],
    'key2':['one','two','one','two','one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df5

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [ ]:
#딕셔너리 형식으로 만들어져 있는데, 중복되어 있는 값들도 있고. 
g = df5[ ['key1', 'data2'] ].groupby('key1') #그룹화 됐음

for x,y in g:
  print(x)
  print(y)

A
  key1  data2
0    A     10
1    A     20
4    A     50
B
  key1  data2
2    B     30
3    B     40

In [ ]:
g.sum()

      data2
key1
A        80
B        70

#### Pandas 연습 04-4

1. 선실(Pclass), 성별(Sex)로 생존자 수를 구하라.

In [ ]:
##타이타닉 04-04 6회차

train[ ['Pclass','Sex','Survived'] ].groupby( ['Pclass','Sex'] ).sum()

               Survived
Pclass Sex
1      female        91
       male          45
2      female        70
       male          17
3      female        72
       male          47

In [ ]:
##타이타닉 04-04 5회차

p_s_s = train[ ['Pclass','Sex','Survived'] ]
p_s_s.groupby( ['Pclass','Sex'] ).sum()

               Survived
Pclass Sex
1      female        91
       male          45
2      female        70
       male          17
3      female        72
       male          47

In [ ]:
##타이타닉 04-04 4회차
##선실(Pclass), 성별(Sex)로 생존자 수를 구하라. 당연히 Survived도 필요함

train[ ['Pclass','Sex', 'Survived'] ].value_counts() #이게 뭐지?

train[ ['Pclass','Sex', 'Survived'] ].groupby( [ 'Sex','Pclass' ] ).sum() #아하! 그룹바이는 묶어주고 싶은 열들끼리 묶어서 내보내주는구나!!!

               Survived
Sex    Pclass
female 1             91
       2             70
       3             72
male   1             45
       2             17
       3             47

In [ ]:
##타이타닉 04-04 3회차
##선실(Pclass), 성별(Sex)로 생존자 수를 구하라.

#그룹바이를 쓴다는데, 어떻게?
#선실, 성별로  생존자 구하기. 아. 3개 팬시 인덱싱으로 갖고 와서, 선실하고 성별 그룹바이 시키고 

train[ ['Pclass','Sex','Survived']].groupby( ['Pclass','Sex'] ).sum() #와 이렇게 완벽하게 나온다고?

               Survived
Pclass Sex
1      female        91
       male          45
2      female        70
       male          17
3      female        72
       male          47

In [ ]:
#선실을 키로 잡으면 각 선실 별로 키가 나오고 생존자가 나올 거임. 
#우린 선실/ 성별/ 생존자 만 필요함.

#그룹화는 리스트로 넣으면 순서별로 여러개 만들기 가능.

train[ ['Pclass','Sex','Survived'] ].groupby('Pclass').sum()    #3개 한번에 넣고, 그 다음에 그룹바이에 피클래스 넣고, 이걸 더하면 클래스별 생존자가 나옴.
train[ ['Pclass','Sex','Survived'] ].groupby( ['Pclass','Sex'] ).sum()    #이렇게 하면 생존자는 1, 사망자는 0이니까 합계로 구하면 => 나온 숫자는 자동으로 생존자수가 됨.
                                                                          #한번에 그룹화 2개도 가능하다는 거.

               Survived
Pclass Sex
1      female        91
       male          45
2      female        70
       male          17
3      female        72
       male          47

In [ ]:
##타이타닉 04-04 2회차
##선실(Pclass), 성별(Sex)로 생존자 수를 구하라.

#그룹바이 쓸 거야~ 생존자 수 구하는 거잖아?
#그럼 나는 Pclass, Sex, Survived만 있으면 돼. 그럼 그거만 train에서 뽑아오자! 어떻게? 팬시 인덱싱으로 리스트 넣어줘서 뽑으면 돼!

train_p_s_s = train[ ['Pclass','Sex','Survived'] ]  # 난 근데 지금 이거 뽑아올 수 있는 게 열중심이라 가능하다는 생각이 드네? 만약에 .loc으로 뽑는다면?

# 아 이거 궁금한데? 만약에 loc으로 이렇게 뽑아놓았으면 어떻게 .groupby 할 수 있나??
t_p = train.loc[ :,'Pclass' ]
t_se = train.loc[:, 'Sex']
t_su = train.loc[:,'Survived']


train_p_s_s.groupby( ['Pclass','Sex'] ).sum() #여기서 Survived 안넣어줘도 되는 이유는 어짜피 더해주면 0이랑 1이랑 더한 거라 나온 수가 생존자 수임.!

               Survived
Pclass Sex
1      female        91
       male          45
2      female        70
       male          17
3      female        72
       male          47

## Pandas 요약

### 데이터프레임(Dataframe)과 시리즈(Series)

In [ ]:
# 시리즈와 데이터프레임 두 가지가 기본이다
# 자동으로 인덱스가 만들어진다

import numpy as np
import pandas as pd

In [26]:
##판다스 요약 5회차

dic = {'city': ['서울', '부산', '대전', '대구', '광주'],
        'year': [2017, 2017, 2018, 2018, 2018],
        'temp': [18, 20, 19, 21, 20]}


#'year', 'city', 'temp'를 가지고 데이터 프레임 만들어라
df = pd.DataFrame( dic )
df
# index -> 'a','b','c','d','e' 인덱스에 이름 추가하라는 이야기
df.index = 'a','b','c','d','e'
df

# columns -> '도시','연도','날씨' 열 부분에 추가하라는 거~
df.columns = '도시','연도','날씨'
df

# index -> '도시'
#f.columns.name = '특성'
df.index.name = '도시'
df.columns.name = '특성'
df

특성  도시    연도  날씨
도시
a   서울  2017  18
b   부산  2017  20
c   대전  2018  19
d   대구  2018  21
e   광주  2018  20

In [ ]:
##판다스 요약 4회차

dic = {'city': ['서울', '부산', '대전', '대구', '광주'],
        'year': [2017, 2017, 2018, 2018, 2018],
        'temp': [18, 20, 19, 21, 20]}

#'year', 'city', 'temp'를 가지고 데이터 프레임 만들어라
df = pd.DataFrame(dic)
df

# index -> 'a','b','c','d','e' 인덱스에 이름 추가하라는 이야기
df.index = ['a','b','c','d','e']
df
# columns -> '도시','연도','날씨' 열 부분에 추가하라는 거~
df.columns = [ '도시','연도','날씨' ]
df

# index -> '도시'
#f.columns.name = '특성'
df.index.name = '도시'
df.columns.name = '특징'
df

특징  도시    연도  날씨
도시
a   서울  2017  18
b   부산  2017  20
c   대전  2018  19
d   대구  2018  21
e   광주  2018  20

In [ ]:
##판다스 요약 3회차

dic = {'city': ['서울', '부산', '대전', '대구', '광주'],
        'year': [2017, 2017, 2018, 2018, 2018],
        'temp': [18, 20, 19, 21, 20]}

#'year', 'city', 'temp'를 가지고 데이터 프레임 만들어라
df = pd.DataFrame( dic )
df

# index -> 'a','b','c','d','e' 인덱스에 이름 추가하라는 이야기
df.index = [ 'a','b','c','d','e' ]
df

# columns -> '도시','연도','날씨' 열 부분에 추가하라는 거~
df.columns = [ '도시','연도','날씨' ]
df

# index -> '도시'
#f.columns.name = '특성'
df.index.name = '도시'
df
df.columns.name = '특성'
df

특성  도시    연도  날씨
도시
a   서울  2017  18
b   부산  2017  20
c   대전  2018  19
d   대구  2018  21
e   광주  2018  20

In [ ]:
##판다스 요약 2회차

dic = {'city': ['서울', '부산', '대전', '대구', '광주'],
        'year': [2017, 2017, 2018, 2018, 2018],
        'temp': [18, 20, 19, 21, 20]}

#'year', 'city', 'temp'를 가지고 데이터 프레임 만들어라
df = pd.DataFrame( dic )
df

# index -> 'a','b','c','d','e' 인덱스에 이름 추가하라는 이야기
df.index = ['a','b','c','d','e']
df

# columns -> '도시','연도','날씨' 열 부분에 추가하라는 거~
df.columns = ['도시','연도','날씨']
df

# index -> '도시'
#f.columns.name = '특성'
df.index.name = '도시' #이거 리스트로 채워넣으면 Index.name must be a hashable type 이런 오류 뜸. 바른님이 풀어주신 거!!
df

    도시    연도  날씨
도시
a   서울  2017  18
b   부산  2017  20
c   대전  2018  19
d   대구  2018  21
e   광주  2018  20

In [ ]:
dic = {'city': ['서울', '부산', '대전', '대구', '광주'],
        'year': [2017, 2017, 2018, 2018, 2018],
        'temp': [18, 20, 19, 21, 20]}

In [ ]:
#'year', 'city', 'temp'를 가지고 데이터 프레임 만들어라

df = pd.DataFrame( dic )
df

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2018    19
3   대구  2018    21
4   광주  2018    20

In [ ]:
# index -> 'a','b','c','d','e' 인덱스에 이름 추가하라는 이야기
ind = ['a','b','c','d','e']

df.index = ind
df

  city  year  temp
a   서울  2017    18
b   부산  2017    20
c   대전  2018    19
d   대구  2018    21
e   광주  2018    20

In [ ]:
# columns -> '도시','연도','날씨' 열 부분에 추가하라는 거~
col = ['도시','연도','날씨']
df.columns = col
df

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [ ]:
# index -> '도시'
## 여기 모르겠다. 질문해야할 부분

df[index_col='도시']
df

SyntaxError: ignored

### 람다 함수

In [ ]:
f = lambda x: x.max() - x.min()

df = pd.DataFrame(np.arange(12).reshape(4, 3), 
                  columns=['A', 'B', 'C'], index=['a', 'b', 'c', 'd'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

### Series

In [ ]:
# 파이썬 기본 타입인  딕셔너리로부터 시리즈를 만들 수 있다
dic = {'서울':800, '부산':150, '대구': 100}
dic

{'대구': 100, '부산': 150, '서울': 800}

##데이터 프레임 응용

### 데이터 프레임 열 재구성 (열 순서 변경)

In [ ]:
#데이터 프레임 순서 바꾸기. 출력되는 열의 순서를 바꾸고 싶을 때! 열의 순서를 재구성하고 싶을 때!
#이거 복습 좀 해야겠다 ㅋㅋ 뭔 개소린지 모르겠네!
import seaborn as sns

df = sns.load_dataset( 'titanic' )
df.head(3)

#df.loc[0:4, ] #왜 0부터 4가 되냐면, 인덱스 이름이 0~4라서 그래. 그러니까. 서울 부산 이런 것처럼 걍 0 4 이런 거라서 그럼. 이상 이하 그런 게 아니고. 

df = df.loc[0:4, 'survived':'age']

columns = list(df.columns.values) #이렇게 하면 열들의 이름이 리스트로 바뀜. 세팅되어있는 값을 리스트로 가져오고 싶을 때

#컬럼을 sort하고 싶다면?
col_sorted = sorted(columns)
df[ col_sorted ]

#이걸 뒤집고 싶다면?
df[ reversed(col_sorted) ]

   survived     sex  pclass   age
0         0    male       3  22.0
1         1  female       1  38.0
2         1  female       3  26.0
3         1  female       1  35.0
4         0    male       3  35.0

In [ ]:
df = pd.read_excel(drive_path + '주가데이터.xlsx')
df

          연월일   당일종가  전일종가     시가     고가     저가     거래량
0  2018-07-02  10100   600  10850  10900  10000  137977
1  2018-06-29  10700   300  10550  10900   9990  170253
2  2018-06-28  10400   500  10900  10950  10150  155769
3  2018-06-27  10900   100  10800  11050  10500  133548
4  2018-06-26  10800   350  10900  11000  10700   63039
5  2018-06-25  11150   150  11400  11450  11000   55519
6  2018-06-22  11300   100  11250  11450  10750  134805
7  2018-06-21  11200   350  11350  11750  11200  133002
8  2018-06-20  11550   250  11200  11600  10900  308596
9  2018-06-19  11300   700  11850  11950  11300  180656
10 2018-06-18  12000  1400  13400  13400  12000  309787
11 2018-06-15  13400    50  13600  13600  12900  201376
12 2018-06-14  13450   250  13200  13700  13150  347451
13 2018-06-12  13200  1250  12200  13300  12050  558148
14 2018-06-11  11950     0  12000  12250  11950   62293
15 2018-06-08  11950     0  11950  12200  11800   59258
16 2018-06-07  11950   200  12200  12300  11900   49088
17 2018-06-05  12150   250  11800  12250  11800   42485
18 2018-06-04  11900     0  11900  12200  11700   25171
19 2018-06-01  11900   100  11800  12100  11750   32062

In [ ]:
df['연월일'] #날짜로 분리하면 힘들고, str로 바꿔서 자릿수로 쪼갤 거임.
df['연월일'].astype('str')
df['연월일'] = df['연월일'].astype('str')

In [ ]:
df['연월일'].str #이렇게 하면 split 할 수가 있음. str은 split이 가능이니까.
dates = df['연월일'].str.split('-') #보통 시계열 데이터 처리할 때 공식처럼 이렇게 많이 사용함. 공식처럼.

In [ ]:
dates.str.get(0) #0번째 거 갖고 오기
df['연'] = dates.str.get(0)
df['월'] = dates.str.get(1)
df['일'] = dates.str.get(2)

df.head() #head() 하면 5개씩 나옴.

          연월일   당일종가  전일종가     시가     고가     저가     거래량     연   월   일
0  2018-07-02  10100   600  10850  10900  10000  137977  2018  07  02
1  2018-06-29  10700   300  10550  10900   9990  170253  2018  06  29
2  2018-06-28  10400   500  10900  10950  10150  155769  2018  06  28
3  2018-06-27  10900   100  10800  11050  10500  133548  2018  06  27
4  2018-06-26  10800   350  10900  11000  10700   63039  2018  06  26

### 데이터프레임 합치기

* concat(), merge(), join()

In [ ]:
df1 = pd.DataFrame({'a': ['a0', 'a1', 'a2', 'a3'],
                    'b': ['b0', 'b1', 'b2', 'b3'],
                    'c': ['c0', 'c1', 'c2', 'c3']},
                    index=[0, 1, 2, 3])
 
df2 = pd.DataFrame({'a': ['a2', 'a3', 'a4', 'a5'],
                    'b': ['b2', 'b3', 'b4', 'b5'],
                    'c': ['c2', 'c3', 'c4', 'c5'],
                    'd': ['d2', 'd3', 'd4', 'd5']},
                    index=[2, 3, 4, 5])
print(df1)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

In [ ]:
#어떻게 합치냐면, 위 아래로 합칠 때. 행방향으로 합칠 때. 축이 0일 때!

pd.concat( [df1, df2] ) #하나만 합치는 게 아니라 여러개 합치기도 가능. 데이터프레임 목록을 리스트로 넣어주면 전체를 합쳐줌

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

In [ ]:
#위에는 인덱스가 좀 이상한데, 인덱스를 새로 구성하고 싶다하면 ignore_index=True 라는 옵션이 있음.
pd.concat( [df1,df2], ignore_index=True) #ignore_index=True 이거는 기존 인덱스 무시한다는 이야기임.

In [ ]:
#행방향으로 연결할 때, 0번째 축. 
pd.concat( [df1,df2], ignore_index=True)

#열방향으로 연결할 때, 1번째 축.
pd.concat( [df1,df2], axis = 1 ) #문제는 인덱스에 맞춰서 연결하는 거라 Nan이 등장함. 인덱스에 맞춰서 합치는 거라.. 없는 거는 없다고 뜨는 거임

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [ ]:
#concat의 옵션 중에 교집합으로 합치는 것도 있다.
#join 옵션이 있는데, 기본적으로 join은 outer임. 근데 join = 'inner' 이렇게 하면
pd.concat( [df1,df2], axis=1, ignore_index=True) #이걸 왜 하냐면, 데이터베이스 과목에 아마 나올 거임.

In [ ]:
#교집합
pd.concat( [df1,df2], axis=1, ignore_index=True, join = 'inner')

#데이터프레임 병합

In [ ]:
#merge를 활용할 거에요!

df1 = pd.read_excel(drive_path + 'stock price.xlsx')
df2 = pd.read_excel(drive_path + 'stock valuation.xlsx')
print(df1)
print(df2)

       id stock_name          value   price
0  128940       한미약품   59385.666667  421000
1  130960     CJ E&M   58540.666667   98900
2  138250      엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280     녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400      쿠쿠홀딩스  179204.666667  177500
8  199800         툴젠   -2514.333333  115400
9  204210     모두투어리츠    3093.333333    3475
       id       name           eps     bps        per       pbr
0  130960     CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480         하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480        이마트  18268.166667  295780  13.931338  0.860437
4  145990        삼양사   5741.000000  108090  14.283226  0.758627
5  161390      한국타이어   5648.500000   51341   7.453306  0.820007
6  181710  NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750        종근당   3990.333333   40684  25.185866  2.470259
8  204210     모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940   삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [ ]:
#그냥 이런 게 있구나 하고 넘어가는 거야~ 수업 듣는 것에 의의를 두자 ㅎㅎ

#교집합을 해보자. join = 'inner'
pd.merge(df1, df2)  #이렇게 조인이 됨. 오른쪽에 붙힌 것. 얘는 기본적으로 그냥 합치면 교집합으로 합쳐짐. join = 'inner'가 기본으로 됨.

#합집합
pd.merge(df1, df2, how='outer', on='id') #합집합은 똑같은데 뒤에 옵션이 붙음. 얘는 join이 아니라 how로 됨. 실제 프로젝트 할 때는 데이터가 난리남.

#왼쪽 기준, 키 값 분리. 왼쪽 기준으로 하면 how가 left로 바뀐다.
pd.merge(df1, df2, how='left', left_on='stock_name', right_on='name') #id말고 다른 거로 매칭하려고 하는데..그럼 on에 오른쪽 왼쪽 이렇게 들어감.

#오른쪽 기준으로 키와 값 분리한다면? how만 right로 바꾸면 됨.
pd.merge(df1, df2, how='right', left_on='stock_name', right_on='name') #오른쪽은 값이 다 있는데, 왼쪽에 없는 게 생기지

       id_x stock_name          value  ...     bps        per       pbr
0  130960.0     CJ E&M   58540.666667  ...   54068  15.695091  1.829178
1       NaN        NaN            NaN  ...    3551  11.489362  0.887074
2       NaN        NaN            NaN  ...   14894   6.313806  0.899691
3  139480.0        이마트  239230.833333  ...  295780  13.931338  0.860437
4  145990.0        삼양사   82750.000000  ...  108090  14.283226  0.758627
5       NaN        NaN            NaN  ...   51341   7.453306  0.820007
6       NaN        NaN            NaN  ...   78434  30.755864  0.827447
7  185750.0        종근당   40293.666667  ...   40684  25.185866  2.470259
8  204210.0     모두투어리츠    3093.333333  ...    5335  40.802348  0.651359
9       NaN        NaN            NaN  ...   60099  89.790059  6.938551

[10 rows x 10 columns]

###데이터프레임 결합

In [ ]:
#결합(join)
df1 = pd.read_excel(drive_path + 'stock price.xlsx', index_col='id') #기본적으로 인덱스를 가지고 join을 함. join은 인덱스에 있는 걸 기준으로 합친다.
df2 = pd.read_excel(drive_path + 'stock valuation.xlsx')

df1.join(df2) #합집합 된 것.

#교집합
df1.join(df2, how='inner')

Empty DataFrame
Columns: [stock_name, value, price, id, name, eps, bps, per, pbr]
Index: []

#멀티 인덱스

In [ ]:
import seaborn as sns

#시각화하는 그거인데, 최신 타이타닉 데이터 갖고 오기 위해서임.

titanic = sns.load_dataset('titanic') #타이타닉 데이터를 갖고 오기
titanic.info()    #나이, 성별, 클래스, 요금, 생존 이렇게 5개 인덱스 활용할 거임.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [ ]:
titanic[['sex','age','class','fare','survived']]    #여러개 뽑을 때는 리스트로 뽑아주자구!

        sex   age   class     fare  survived
0      male  22.0   Third   7.2500         0
1    female  38.0   First  71.2833         1
2    female  26.0   Third   7.9250         1
3    female  35.0   First  53.1000         1
4      male  35.0   Third   8.0500         0
..      ...   ...     ...      ...       ...
886    male  27.0  Second  13.0000         0
887  female  19.0   First  30.0000         1
888  female   NaN   Third  23.4500         0
889    male  26.0   First  30.0000         1
890    male  32.0   Third   7.7500         0

[891 rows x 5 columns]

In [ ]:
#그룹바이 쓸 건데, .groupby() 안에 여러개 넣을 때는 리스트로 넣어주는 거 잊지마! 
#아까 했던 거 잠깐 복습한 고임!

df = titanic[['sex','age','class','fare','survived']]

#titanic[['sex','age','class','fare','survived']].groupby( ['sex','age'] ).sum()
df.groupby( ['class','sex'] ).sum() #그룹에 관련돼서 모든 열들이 각각의 합계를 구하게 됐음. 나이를 다 합치거나 운임 다 합치는 건 별 의미가 없잖아?
df_g = df.groupby( ['class','sex'] )
df_g

In [ ]:
#이건 좀 더 의미가 있겠지? 나이 평균과 운임 평균. 평균과 합계를 가장 많이 사용함. 
df_g.mean()

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [ ]:
#이거자체가 데이터 프레임이라서 loc으로 가져올 수가 있음
#퍼스트에서 여성인 데이터만 가지고 오겠다! 멀티 인덱스로 조건을 거는 거임.

df_g.mean().loc[ ('First','female') ]

#남성만 중간에서 가져오고 싶다면..? 
df_g.mean().xs('male', level = 'sex') #이렇게 하면 성별에 남성이 있는 것들만 모아줌. 이건 진짜 모야...... 진짜 모야 이게!!!!!!!!!!!!

              age       fare  survived
class
First   41.281386  67.226127  0.368852
Second  30.740707  19.741782  0.157407
Third   26.507589  12.661633  0.135447

#데이터 사전 처리

이 아래부터 있는 것들은 이제 데이터 전처리할 때 체크리스트처럼 쓰면 좋아. 이상 없다는 거 확인하는 그런 느낌?

결측치(누락 데이터) 처리

In [ ]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [ ]:
#결측치가 가장 많은 deck 이 녀석부터 한번 보자

df[ 'deck' ].value_counts()
#null data는 안나오고 있음. 이걸 나오게 하려면 dropna=False 해주면 됨. 결측치 떨궈주는 걸 False로 바꿔줬으니까!
df[ 'deck' ].value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [ ]:
#결측치가 얼마나 바뀌었는지 보고 싶다면
df.head().isnull() #null 위치는 True로 나옴. null인 녀석들은 True로 나옴.

   survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0     False   False  False  False  ...   True        False  False  False
1     False   False  False  False  ...  False        False  False  False
2     False   False  False  False  ...   True        False  False  False
3     False   False  False  False  ...  False        False  False  False
4     False   False  False  False  ...   True        False  False  False

[5 rows x 15 columns]

In [ ]:
#누락 데이터 합계가 몇개인지 확인하고 싶을 때! 
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [ ]:
#누락데이터는 채우는 방법도 있고 제거하는 방법도 있다. 아니면 그 열 자체를 사용하지 않는 방법도 있음

누락 데이터 제거

In [ ]:
#샘플데이터 만들어서 제거해보겠음!

df_rc = pd.DataFrame({'name':['kim', 'lee', 'park'],
                      'age':[10, 20, 30],
                      'height':[170, 160, 180]})

df_rc.drop( [0,1], axis=0 ) #뭐가 삭제됐나요? 원본엔 영향을 주지 않는다. 0과 1의 행을 삭제했다. 이건 계속 얘기하지만 팬시 인덱싱임.
df_rc.drop( ['name'], axis=1 ) #name만 삭제하고 싶다. 한 열을 삭제하고 싶을 때.

   name  age  height
2  park   30     180

In [ ]:
#타이타닉에서 결측치 
#보통 몇개 이상의 null 있으면 그냥 그 열은 사용하지 않겠다! 이렇게 많이 함.
df.isnull()

#dropna() 자주 사용함.
#데이터가 500개 이상 있는 경우를 제외하고는 삭제해라! 500개 이상 없으면 삭제하라는 이야기. 
df.dropna(axis=1, thresh=500).head(3) #축을 1로, 1방향으로 하고..  thresh= 이거는 데이터가 몇개이상인 것만 남겨놓고 나저민 삭제해라!. 이거 돌리면 deck은 삭제됨

   survived  pclass     sex   age  ...  adult_male  embark_town  alive  alone
0         0       3    male  22.0  ...        True  Southampton     no  False
1         1       1  female  38.0  ...       False    Cherbourg    yes  False
2         1       3  female  26.0  ...       False  Southampton    yes   True

[3 rows x 14 columns]

누락데이터 치환

In [ ]:
#1) 누락데이터를 평균으로 바꾸기

df['age'].value_counts(dropna=False)

age_mean = df['age'].mean()
df['age'].fillna(age_mean.inplace=True) #True면 원본 수정하겠다

df['age'].value_counts(dropna=False)  #값이 바뀌어있는 걸 볼 수 있다. 평균 연산을 해서 나이대가 다 소수점으로 들어감.

NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
66.00      1
23.50      1
0.42       1
Name: age, Length: 89, dtype: int64

In [ ]:
#2) 빈도수로 누락 데이터 치환

embark_town_idxmax = df['embark_town'].value_counts().idxmax() #idxxmax()빈도수가 가장 많이 나왔던 녀석으로 치환 기본값은 inplace = False​이다. (기본값이기 때문에 따로 입력하지 않아도 된다)
                                            #inplace = False을 써주면 데이터가 업데이트되는 게 아니라 복사본을 출력한다.
df['embark_town'].fillna(embark_town_idxmax, inplace=True)
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      0
alive            0
alone            0
dtype: int64

In [ ]:
#3) 이웃하는 값 찾기
df['embarked'].fillna(method= 'ffill',inplace=True)  #method= 'ffill 이거 해주면 바로 앞에 있는 거로 체크해줘야함. 근데 이거 할 때 가장 첫번째 값이 공란이 아닌 걸 확인해줘야함.
df.isnull().sum()   #메꿀 수 없을 때는 이런 값이라도 써야지. 데이터 수집하기가 어려워서 버릴 수가 없음..

###중복데이터 처리

In [ ]:
#데이터에서 자주 발생하는 것 중 하나가 중복 데이터. 카운팅이 2번 들어가니까 이것도 좀 제거해줘야함.

#중복 데이터 확인하는 법
df.duplicated() #중복된 녀석들은 True라고 나옴. 어디가 중복됐는지 열 이름을 쓰면 좀 더 편하겠지? 뭐 나이라든가 ..

0      False
1      False
2      False
3      False
4      False
       ...
886     True
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [ ]:
#샘플데이터 만들어서 해보자

# 중복 데이터 확인
df_dup = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                       'c2':[1, 1, 1, 2, 2],
                       'c3':[1, 1, 2, 2, 2]})
df_dup.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [ ]:
#중복 데이터 제거

df_dup.drop_duplicates(inplace=True) #이렇게 하먄 삭제되서 나오고, inplace=True까지 해주면 원본데이터까지 바꿔줌.
df_dup

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

## 데이터 표준화

- 데이터 포맷을 일관성 있게 표준화

In [ ]:
#데이터 표준화

#1) 단위 환산. 단위를 통일시켜주고 싶을 때. 이건 어렵지 않고 단위환산을 어떻게 할 것인가에 대한 부분임.
# ex) mpg(mile per galion) -> kpl(killometer per liter)
mpg_to_kpl = 1.60934 / 3.78541 #뭐 이런 거...

#소수점 건드리기
df['age'].round(2) #소수점 둘째자리까지 나옴 df타이타닉임 ㅋㅋ

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [ ]:
#자료형 변환, 즉 자료형 통일

### 범주형(카테고리) 데이터 처리

구간 분할
 - 연속 데이터를 그대로 사용하지 않고 일정 구간(bin)으로 나눠서 분석 -> 효율적일 경우

 원핫인코딩
 - 범주형 데이터를 0과 1로만 구성된 것으로 변환(원핫 벡터). 선형대수에선 희귀벡터라고 하기도 함.

In [ ]:
#카테고리 써서 했던 것들이 범주형 데이터 처리임! 효율적인 경우에만 씀!!!
#매직넘버라고 하는데, 5 ~ 8개 정도가 범주화 시키기 제일 좋음. 

#원핫인코딩

###정규화 

- 숫자 데이터의 상대적인 크기 차이를 제거

In [ ]:
#이거 하기엔 연비하는 게 좋으니까 시본에서 mpg 갖고와볼게 
df = sns.load_dataset('mpg')
df['horsepower'] / abs( df['horsepower'].max() )

#df.info()

0      0.565217
1      0.717391
2      0.652174
3      0.652174
4      0.608696
         ...
393    0.373913
394    0.226087
395    0.365217
396    0.343478
397    0.356522
Name: horsepower, Length: 398, dtype: float64

In [ ]:
min_x = df['horsepower'] - df['horsepower'].min()
min_x.max()

184.0

In [ ]:
#오늘도 수업 때 안졸고 잘 버텼다... 집 가서 복습하면 어떻게든 될 거야. 안되도 괜찮아. 내일 또 하면 되지. 내일 안돼? 그럼 내일 모레에 또하고. 그 다음에 또하고 ㅋㅋㅋ 그렇게 하면 돼 ㅎㅎ
#데이터 분석하는 건 재밌어. 진짜 재밌는 것 같아. 캐글 보는 것도 재밌고. 데이터 분석은 진짜 재밌어. 지금 뭐가 너무 많아서 그렇고. 이거

## 판다스 시계열 데이터 처리

- 판다스 시간 표시 유형
1. TImestamp : 특정한 시점을 기록
2. period : 두 시점 사이의 일정한 기간을 표시